
# Площадь по стороне
def S(a):
    return (a ** 2 * (3**0.5)) / 4

# Высота по стороне
def H(a):    
    return (a * (3**0.5)) / 2

# Радиус впис.окр по стороне
def r(a):
    return a / (2* (3**0.5))

# Радиус опис.окр по стороне
def R(a):
    return (a * (3**0.5)) / 3

# Сторона по площади
def AbS(s):
    return ((s * 4) / (3**0.5)) ** 0.5

# Сторона по высоте
def AbH(h):
    return (2 * h) / (3**0.5)

# Сторона по радиусу впис. окр.
def Abr(r):
    return (6 * v) / (3 ** 0.5)

# Сторона по радиусу опис. окр
def AbR(R):
    return (3 * R) / (3 ** 0.5)

def Out(arr):
    print("Сторона: ", c[0])
    print("Площадь: ", c[1])
    print("Высота: ", c[2])
    print("Радиус впис. окр.: ", c[3])
    print("Радиус опис. окр.: ", c[4])


# 0 - сторона, 1 полщадь, 2 - высота, 3 - радиус впис. окр., 4 - радиус опис. окр
c = [0, 0, 0, 0, 0]
(i, v) = list(map(float, input(
    "Введите нормер характеристики и ее значение через пробел \n" + 
    "0 - сторона, 1 полщадь, 2 - высота, 3 - радиус впис. окр., 4 - радиус опис. окр"
    ).split(' ')))
i = int(i)
c[i] = v

# Введена сторона
if (i==0):
    c[1] = S(v)
    c[2] = H(v)
    c[3] = r(v)
    c[4] = R(v)
# Введена площадь
elif (i == 1):
    c[0] = AbS(v)
    c[2] = H(c[0])
    c[3] = r(c[0])
    c[4] = R(c[0])
# Введена высота
elif (i == 2):
    c[0] = AbH(v)
    c[1] = S(c[0])
    c[3] = r(c[0])
    c[4] = R(c[0])
# Введен радиус впис. окр.
elif (i == 3):
    c[0] = Abr(c[0])
    c[1] = S(c[0])
    c[2] = H(c[0])
    c[4] = R(c[0])
# Введен радиус опис. окр.
elif (i == 4):
    c[0] = AbR(v)
    c[1] = S(c[0])
    c[2] = H(c[0])
    c[3] = r(c[0])

Out(c)